Project/Toir.Adaptation/src/Documents/торо_УстановкаСтоимостейКвалификаций/торо_УстановкаСтоимостейКвалификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f12dd42f-d684-40fc-8330-d78eaf2fe15e">
  <name>торо_УстановкаСтоимостейКвалификаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="526fb7ee-6424-42cc-b6ea-623415753ccd">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_СтоимостьЧасаКвалификации/торо_СтоимостьЧасаКвалификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d1173aa4-d886-4d5e-bc47-eeda2d50596d">
  <name>торо_СтоимостьЧасаКвалификации</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="8b3bc9d7-6451-47f0-baf1-23ad0bafc53d">
    <name>Стоимость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ee7e8f11-c2e5-489a-9030-54b085c1e3fc">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="72bae6c2-13df-490b-a7ef-22211c8dd503">
    <name>Квалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="40f85f13-40f4-42f5-bc30-c88c55f1822f">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_УстановкаСтоимостейКвалификаций/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура Расш_гкс_ОбработкаПроведения(Отказ, Режим)

	Если СтоимостьЧаса.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='En el documento no es rellenada la parte tabular стоимостей de la hora. ¡La realización es imposible!';ru='В документе не заполнена табличная часть стоимостей часа. Проведение невозможно!';en='The document does not fill out the tabular part of the hourly costs. Conducting is impossible!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = НСтр("es='¡No заполненно el significado escardando ""la Organización""!';ru='Не заполненно значение поля ""Организация""!';en='The value of the field ""Organization"" is not filled!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;

	Движения.торо_СтоимостьЧасаКвалификации.Записывать = Истина;
	Движения.торо_СтоимостьЧасаКвалификации.Очистить();
	Для Каждого ТекСтрокаСтоимость Из СтоимостьЧаса Цикл
		Движение = Движения.торо_СтоимостьЧасаКвалификации.Добавить();
		Движение.Период = Дата;
		#Вставка
		Движение.Организация = Организация;
		#КонецВставки
		Движение.Валюта = ТекСтрокаСтоимость.Валюта;
		Движение.Стоимость = ТекСтрокаСтоимость.СтоимостьНормочаса;
		Движение.Квалификация = ТекСтрокаСтоимость.Квалификация;
	КонецЦикла;


КонецПроцедуры

&После("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗначениеЗаполнено(Организация) Тогда 	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Организации.гкс_ВидЦены.ВалютаЦены КАК Валюта
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Организация);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Для Каждого СТ Из СтоимостьЧаса Цикл
			СТ.Валюта = Выборка.Валюта;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
